20230202183436-codeigniter.org
:PROPERTIES:
:ID:       0ffb8984-e7e2-47c2-bd8e-64e3b769f7f6
:mtime:    20241102180218 20241028101410
:ctime:    20230202183436
:END:
#+title: CodeIgniter
* 概要
[[id:82360e75-76ce-4efa-aa24-f93adfce1f50][PHP]]の軽量Webフレームワーク。
* Memo
* Tasks
* Reference
** [[https://qiita.com/s-higuma/items/ab8fa110b13301d0c959][Eloquentを単体で導入している時にDBファサードを使用する方法 - Qiita]]
単体で使う方法。
** [[http://tobaby.es.land.to/user_guide_ja/libraries/output.html][出力クラス : CodeIgniter ユーザガイド 日本語版]]

#+begin_src php
  $this->output->set_output($data);
#+end_src

#+begin_quote
最終出力の文字列を手動でセットできます。

Important: 手動で出力をセットしたとき、呼ばれているメソッドの処理がそこで終わります。たとえば、コントローラのメソッドの中で、ページを構築した場合、処理の最後になるまで、出力をセットしてはいけません。
#+end_quote
** [[https://qiita.com/temori1919/items/8755060a5207e8e01194][Codeigniter3でLaravelのEloquentを使いたい - Qiita]]
導入方法。
** [[https://qiita.com/ftakahiro190307/items/4d29993ddf46292413e1][CodeIgniterのルーティング設定 - Qiita]]
apacheの設定の参考。
** [[https://codeigniter.jp/user_guide/3/general/welcome.html][CodeIgniter へようこそ — CodeIgniter 3.2.0-dev ドキュメント]]
公式ページ。
** [[https://digilib.stekom.ac.id/assets/dokumen/ebook/feb_AM6LPNzqWwIrmI-dzEPP-KqX7d4-erFagDKn-TyJkA_SotwB9X3SQQ_1663219905.pdf][codeiginter test]]
** [[https://github.com/kenjis/ci-phpunit-test/blob/master/docs/HowToWriteTests.md#hooks][ci-phpunit-test/HowToWriteTests.md at master · kenjis/ci-phpunit-test]]
codeigniterのテストライブラリの公式ドキュメント。
* Archives
** DONE DockerでCodeIgniterの環境整備する
CLOSED: [2023-01-10 Tue 22:29]
:PROPERTIES:
:Effort:   2:00
:END:
:LOGBOOK:
CLOCK: [2023-01-10 Tue 21:43]--[2023-01-10 Tue 22:08] =>  0:25
CLOCK: [2023-01-10 Tue 21:18]--[2023-01-10 Tue 21:43] =>  0:25
:END:

- Dockerfile作成
  - [[https://github.com/kijimaD/my_codeigniter][kijimaD/my_codeigniter: codeigniter playground]]

#+caption: コンテナ内でcreate-project実行
#+begin_src shell
  composer create-project codeigniter4/appstarter myProject
#+end_src

立ち上げられるのを確認した。

#+caption: DB接続確認方法
#+begin_src shell
  composer test -- ./tests/database/ExampleDatabaseTest.php
#+end_src
