20230202183436-codeigniter.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-11-19 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>CodeIgniter</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">CodeIgniter</h1>
<div id="outline-container-org880f28f" class="outline-2">
<h2 id="org880f28f"><a href="#org880f28f">概要</a></h2>
<div class="outline-text-2" id="text-org880f28f">
<p>
<a href="20221211233726-php.html#ID-82360e75-76ce-4efa-aa24-f93adfce1f50">PHP</a>の軽量Webフレームワーク。
</p>
</div>
</div>
<div id="outline-container-org10815ed" class="outline-2">
<h2 id="org10815ed"><a href="#org10815ed">Memo</a></h2>
</div>
<div id="outline-container-org5f80794" class="outline-2">
<h2 id="org5f80794"><a href="#org5f80794">Tasks</a></h2>
</div>
<div id="outline-container-org67356ed" class="outline-2">
<h2 id="org67356ed"><a href="#org67356ed">Reference</a></h2>
<div class="outline-text-2" id="text-org67356ed">
</div>
<div id="outline-container-org662d692" class="outline-3">
<h3 id="org662d692"><a href="#org662d692"><a href="https://qiita.com/s-higuma/items/ab8fa110b13301d0c959">Eloquentを単体で導入している時にDBファサードを使用する方法 - Qiita</a></a></h3>
<div class="outline-text-3" id="text-org662d692">
<p>
単体で使う方法。
</p>
</div>
</div>
<div id="outline-container-org339b01c" class="outline-3">
<h3 id="org339b01c"><a href="#org339b01c"><a href="http://tobaby.es.land.to/user_guide_ja/libraries/output.html">出力クラス : CodeIgniter ユーザガイド 日本語版</a></a></h3>
<div class="outline-text-3" id="text-org339b01c">
<div class="org-src-container">
<pre class="src src-php">$this-&gt;output-&gt;set_output($data);
</pre>
</div>

<blockquote>
<p>
最終出力の文字列を手動でセットできます。
</p>

<p>
Important: 手動で出力をセットしたとき、呼ばれているメソッドの処理がそこで終わります。たとえば、コントローラのメソッドの中で、ページを構築した場合、処理の最後になるまで、出力をセットしてはいけません。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orge2094bf" class="outline-3">
<h3 id="orge2094bf"><a href="#orge2094bf"><a href="https://qiita.com/temori1919/items/8755060a5207e8e01194">Codeigniter3でLaravelのEloquentを使いたい - Qiita</a></a></h3>
<div class="outline-text-3" id="text-orge2094bf">
<p>
導入方法。
</p>
</div>
</div>
<div id="outline-container-org15a299c" class="outline-3">
<h3 id="org15a299c"><a href="#org15a299c"><a href="https://qiita.com/ftakahiro190307/items/4d29993ddf46292413e1">CodeIgniterのルーティング設定 - Qiita</a></a></h3>
<div class="outline-text-3" id="text-org15a299c">
<p>
apacheの設定の参考。
</p>
</div>
</div>
<div id="outline-container-org4e10b14" class="outline-3">
<h3 id="org4e10b14"><a href="#org4e10b14"><a href="https://codeigniter.jp/user_guide/3/general/welcome.html">CodeIgniter へようこそ — CodeIgniter 3.2.0-dev ドキュメント</a></a></h3>
<div class="outline-text-3" id="text-org4e10b14">
<p>
公式ページ。
</p>
</div>
</div>
<div id="outline-container-orga0665b1" class="outline-3">
<h3 id="orga0665b1"><a href="#orga0665b1"><a href="https://digilib.stekom.ac.id/assets/dokumen/ebook/feb_AM6LPNzqWwIrmI-dzEPP-KqX7d4-erFagDKn-TyJkA_SotwB9X3SQQ_1663219905.pdf">codeiginter test</a></a></h3>
</div>
<div id="outline-container-org91c09df" class="outline-3">
<h3 id="org91c09df"><a href="#org91c09df"><a href="https://github.com/kenjis/ci-phpunit-test/blob/master/docs/HowToWriteTests.md#hooks">ci-phpunit-test/HowToWriteTests.md at master · kenjis/ci-phpunit-test</a></a></h3>
<div class="outline-text-3" id="text-org91c09df">
<p>
codeigniterのテストライブラリの公式ドキュメント。
</p>
</div>
</div>
</div>
<div id="outline-container-orgc655fe4" class="outline-2">
<h2 id="orgc655fe4"><a href="#orgc655fe4">Archives</a></h2>
<div class="outline-text-2" id="text-orgc655fe4">
</div>
<div id="outline-container-orgff03cea" class="outline-3">
<h3 id="orgff03cea"><a href="#orgff03cea"><span class="done DONE">DONE</span> DockerでCodeIgniterの環境整備する</a></h3>
<div class="outline-text-3" id="text-orgff03cea">
<ul class="org-ul">
<li>Dockerfile作成
<ul class="org-ul">
<li><a href="https://github.com/kijimaD/my_codeigniter">kijimaD/my_codeigniter: codeigniter playground</a></li>
</ul></li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>コンテナ内でcreate-project実行</label><pre class="src src-shell">composer create-project codeigniter4/appstarter myProject
</pre>
</div>

<p>
立ち上げられるのを確認した。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>DB接続確認方法</label><pre class="src src-shell">composer test -- ./tests/database/ExampleDatabaseTest.php
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
